In [4]:
import pandas as pd

In [1]:
dict1 = {
    "name":['perry','harry','sunny','vicky'],
    "age":[55,54,21,45],
    "place":['nagpur','pune','mumbai','delhi']
}

In [5]:
df = pd.DataFrame(dict1)

In [6]:
df

    name  age   place
0  perry   55  nagpur
1  harry   54    pune
2  sunny   21  mumbai
3  vicky   45   delhi

In [7]:
df.head(2)

    name  age   place
0  perry   55  nagpur
1  harry   54    pune

In [9]:
df.tail(1)

    name  age  place
3  vicky   45  delhi

In [10]:
df

    name  age   place
0  perry   55  nagpur
1  harry   54    pune
2  sunny   21  mumbai
3  vicky   45   delhi

In [11]:
df.to_csv('friends.csv')

In [12]:
df.to_csv('friends1.csv', index=False)

In [13]:
df.describe()

             age
count   4.000000
mean   43.750000
std    15.819292
min    21.000000
25%    39.000000
50%    49.500000
75%    54.250000
max    55.000000

In [14]:
perry = pd.read_csv('friends1.csv')

In [15]:
perry

    name  age   place
0  perry   55  nagpur
1  harry   54    pune
2  sunny   21  mumbai
3  vicky   45   delhi

In [16]:
perry.index = ['A','B','C','D']

In [18]:
perry

    name  age   place
A  perry   55  nagpur
B  harry   54    pune
C  sunny   21  mumbai
D  vicky   45   delhi

In [21]:
perry['age']['C']=98

C:\Users\Priyanka\AppData\Local\Temp/ipykernel_18036/4184415627.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  perry['age']['C']=98

In [22]:
perry

    name  age   place
A  perry   55  nagpur
B  harry   54    pune
C  sunny   98  mumbai
D  vicky   45   delhi

In [26]:
ser = pd.Series(np.random.rand(10))

In [28]:
type(ser)

pandas.core.series.Series

In [33]:
newdf = pd.DataFrame(np.random.rand(10,3), index=np.arange(10))

In [35]:
type(newdf)

pandas.core.frame.DataFrame

In [36]:
newdf.describe()

               0          1          2
count  10.000000  10.000000  10.000000
mean    0.521811   0.399960   0.408587
std     0.348821   0.288909   0.324179
min     0.074595   0.110928   0.026641
25%     0.208481   0.176307   0.146263
50%     0.526644   0.307990   0.287451
75%     0.790273   0.555371   0.689134
max     0.995874   0.997144   0.978617

In [38]:
newdf.dtypes

0    float64
1    float64
2    float64
dtype: object

In [40]:
newdf[0][0]='priyanka'

In [41]:
newdf.head(3)

          0         1         2
0  priyanka  0.161386  0.026641
1  0.415576  0.110928  0.120852
2  0.968767  0.717549  0.266273

In [42]:
newdf.dtypes

0     object
1    float64
2    float64
dtype: object

In [43]:
newdf[0][0]=0.3

In [44]:
newdf.head()

          0         1         2
0       0.3  0.161386  0.026641
1  0.415576  0.110928  0.120852
2  0.968767  0.717549  0.266273
3  0.173506  0.307372  0.978617
4  0.696248  0.446157  0.627093

In [47]:
newdf.columns

RangeIndex(start=0, stop=3, step=1)

In [48]:
newdf.to_numpy()

array([[0.3, 0.16138586107180153, 0.02664059154047671],
       [0.4155764705643483, 0.11092800978266715, 0.12085195686085459],
       [0.9687674950992147, 0.7175493569006512, 0.26627311214724303],
       [0.17350649050642974, 0.30737195330972156, 0.9786173931276312],
       [0.696247553700481, 0.44615683636056946, 0.6270928481835254],
       [0.9958740687341854, 0.17327478217430015, 0.7244001491066493],
       [0.07459502083341008, 0.3086074629844574, 0.30862907211229496],
       [0.8216145969918387, 0.5917751092131174, 0.19280432660460345],
       [0.12081291157559948, 0.9971440135937366, 0.13074925147686522],
       [0.637712040007483, 0.18540179133560375, 0.7098147080042791]],
      dtype=object)

In [49]:
newdf.T

,0,1,2,3,4,5,6,7,8,9
0,0.3,0.415576,0.968767,0.173506,0.696248,0.995874,0.074595,0.821615,0.120813,0.637712
1,0.161386,0.110928,0.717549,0.307372,0.446157,0.173275,0.308607,0.591775,0.997144,0.185402
2,0.026641,0.120852,0.266273,0.978617,0.627093,0.7244,0.308629,0.192804,0.130749,0.709815

In [50]:
newdf.sort_index(axis=0, ascending= False)

          0         1         2
9  0.637712  0.185402  0.709815
8  0.120813  0.997144  0.130749
7  0.821615  0.591775  0.192804
6  0.074595  0.308607  0.308629
5  0.995874  0.173275  0.724400
4  0.696248  0.446157  0.627093
3  0.173506  0.307372  0.978617
2  0.968767  0.717549  0.266273
1  0.415576  0.110928  0.120852
0       0.3  0.161386  0.026641

In [51]:
newdf2 = newdf.copy()

In [53]:
newdf2

          0         1         2
0       0.3  0.161386  0.026641
1  0.415576  0.110928  0.120852
2  0.968767  0.717549  0.266273
3  0.173506  0.307372  0.978617
4  0.696248  0.446157  0.627093
5  0.995874  0.173275  0.724400
6  0.074595  0.308607  0.308629
7  0.821615  0.591775  0.192804
8  0.120813  0.997144  0.130749
9  0.637712  0.185402  0.709815

In [54]:
newdf.loc[0,0]=55

In [56]:
newdf.head(2)

          0         1         2
0        55  0.161386  0.026641
1  0.415576  0.110928  0.120852

In [57]:
newdf.columns = ['a','b','c']

In [58]:
newdf

          a         b         c
0        55  0.161386  0.026641
1  0.415576  0.110928  0.120852
2  0.968767  0.717549  0.266273
3  0.173506  0.307372  0.978617
4  0.696248  0.446157  0.627093
5  0.995874  0.173275  0.724400
6  0.074595  0.308607  0.308629
7  0.821615  0.591775  0.192804
8  0.120813  0.997144  0.130749
9  0.637712  0.185402  0.709815

In [61]:
newdf.drop('c',axis=1)

          a         b
0        55  0.161386
1  0.415576  0.110928
2  0.968767  0.717549
3  0.173506  0.307372
4  0.696248  0.446157
5  0.995874  0.173275
6  0.074595  0.308607
7  0.821615  0.591775
8  0.120813  0.997144
9  0.637712  0.185402

In [63]:
newdf.loc[[1,2],['a','b']]

          a         b
1  0.415576  0.110928
2  0.968767  0.717549

In [84]:
first = newdf.loc[1]
print(first)

a    0.415576
b    0.110928
c    0.120852
Name: 1, dtype: object

In [79]:
newdf.loc[(newdf["a"]<0.3)&(newdf["b"]>0.1)]

          a         b         c
3  0.173506  0.307372  0.978617
6  0.074595  0.308607  0.308629
8  0.120813  0.997144  0.130749

In [89]:
newdf.iloc[0,1]

0.16138586107180153

In [90]:
newdf.iloc[[0,4],[1,2]]

          b         c
0  0.161386  0.026641
4  0.446157  0.627093

In [93]:
newdf.drop([1])

          a         b         c
0        55  0.161386  0.026641
2  0.968767  0.717549  0.266273
3  0.173506  0.307372  0.978617
4  0.696248  0.446157  0.627093
5  0.995874  0.173275  0.724400
6  0.074595  0.308607  0.308629
7  0.821615  0.591775  0.192804
8  0.120813  0.997144  0.130749
9  0.637712  0.185402  0.709815

In [98]:
newdf.reset_index(drop=True)

          a         b         c
0        55  0.161386  0.026641
1  0.415576  0.110928  0.120852
2  0.968767  0.717549  0.266273
3  0.173506  0.307372  0.978617
4  0.696248  0.446157  0.627093
5  0.995874  0.173275  0.724400
6  0.074595  0.308607  0.308629
7  0.821615  0.591775  0.192804
8  0.120813  0.997144  0.130749
9  0.637712  0.185402  0.709815

In [104]:
newdf.loc[:,['b']]= None

In [106]:
newdf.isnull()

       a     b      c
0  False  True  False
1  False  True  False
2  False  True  False
3  False  True  False
4  False  True  False
5  False  True  False
6  False  True  False
7  False  True  False
8  False  True  False
9  False  True  False

In [107]:
newdf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       10 non-null     object
 1   b       0 non-null      object
 2   c       10 non-null     float64
dtypes: float64(1), object(2)
memory usage: 368.0+ bytes

In [108]:
env_df = pd.read_csv('environment.csv')

In [109]:
env_df

,year,sector,class,cfn_tle1,cfn_tle2,units,magnitude,source,data_value,flag
0,2009,Central government,Total,Environmental protection expenditure,Final consumption expenditure,Proportion,Actual,Environmental Accounts,1.2,F
1,2010,Central government,Total,Environmental protection expenditure,Final consumption expenditure,Proportion,Actual,Environmental Accounts,1.2,F
2,2011,Central government,Total,Environmental protection expenditure,Final consumption expenditure,Proportion,Actual,Environmental Accounts,1.1,F
3,2012,Central government,Total,Environmental protection expenditure,Final consumption expenditure,Proportion,Actual,Environmental Accounts,1.1,F
4,2013,Central government,Total,Environmental protection expenditure,Final consumption expenditure,Proportion,Actual,Environmental Accounts,1.2,F
...,...,...,...,...,...,...,...,...,...,...
451,2016,Local government,Wastewater,Environmental protection expenditure,Gross fixed capital formation,Dollars,Millions,Environmental Accounts,714.0,F
452,2017,Local government,Wastewater,Environmental protection expenditure,Gross fixed capital formation,Dollars,Millions,Environmental Accounts,700.0,F
453,2018,Local government,Wastewater,Environmental protection expenditure,Gross fixed capital formation,Dollars,Millions,Environmental Accounts,683.0,F
454,2019,Local government,Wastewater,Environmental protection expenditure,Gross fixed capital formation,Dollars,Millions,Environmental Accounts,780.0,P
455,2020,Local government,Wastewater,Environmental protection expenditure,Gross fixed capital formation,Dollars,Millions,Environmental Accounts,824.0,P

In [110]:
env_df.describe()

              year    data_value
count   456.000000    456.000000
mean   2014.500000   3125.131140
std       3.455844   9895.965167
min    2009.000000      0.000000
25%    2011.750000      2.550000
50%    2014.500000     26.450000
75%    2017.250000    772.500000
max    2020.000000  61223.000000

In [117]:
env_df.loc[[0,4],['year','sector']]

   year              sector
0  2009  Central government
4  2013  Central government

In [120]:
env_df.loc[[3],['year']]

   year
3  2012

In [121]:
dict = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score':[np.nan, 40, 80, 98]}

In [122]:
df = pd.DataFrame(dict)

In [123]:
df

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         95.0           NaN         98.0

In [124]:
df.isnull()

   First Score  Second Score  Third Score
0        False         False         True
1        False         False        False
2         True         False        False
3        False          True        False

In [125]:
df.fillna(54)

   First Score  Second Score  Third Score
0        100.0          30.0         54.0
1         90.0          45.0         40.0
2         54.0          56.0         80.0
3         95.0          54.0         98.0

In [126]:
df.dropna()

   First Score  Second Score  Third Score
1         90.0          45.0         40.0

In [134]:
dict2 = {'name':["aparna", "pankaj", "sudhir", "Geeku"],
        'degree': ["MBA", "BCA", "M.Tech", "MBA"],
        'score':[90, 40, 80, 98]}

In [135]:
dff = pd.DataFrame(dict2)

In [136]:
dff

     name  degree  score
0  aparna     MBA     90
1  pankaj     BCA     40
2  sudhir  M.Tech     80
3   Geeku     MBA     98

In [10]:
squares =[]
for i in range(1,101):
    squares.append(i**2)
print(squares)

[1, 4, 9, 16, 25, 36, 49, 64, 81, 100, 121, 144, 169, 196, 225, 256, 289, 324, 361, 400, 441, 484, 529, 576, 625, 676, 729, 784, 841, 900, 961, 1024, 1089, 1156, 1225, 1296, 1369, 1444, 1521, 1600, 1681, 1764, 1849, 1936, 2025, 2116, 2209, 2304, 2401, 2500, 2601, 2704, 2809, 2916, 3025, 3136, 3249, 3364, 3481, 3600, 3721, 3844, 3969, 4096, 4225, 4356, 4489, 4624, 4761, 4900, 5041, 5184, 5329, 5476, 5625, 5776, 5929, 6084, 6241, 6400, 6561, 6724, 6889, 7056, 7225, 7396, 7569, 7744, 7921, 8100, 8281, 8464, 8649, 8836, 9025, 9216, 9409, 9604, 9801, 10000]

In [7]:
squares2 = [i**2 for i in range(1,101)]
print(squares2)

[1, 4, 9, 16, 25, 36, 49, 64, 81, 100, 121, 144, 169, 196, 225, 256, 289, 324, 361, 400, 441, 484, 529, 576, 625, 676, 729, 784, 841, 900, 961, 1024, 1089, 1156, 1225, 1296, 1369, 1444, 1521, 1600, 1681, 1764, 1849, 1936, 2025, 2116, 2209, 2304, 2401, 2500, 2601, 2704, 2809, 2916, 3025, 3136, 3249, 3364, 3481, 3600, 3721, 3844, 3969, 4096, 4225, 4356, 4489, 4624, 4761, 4900, 5041, 5184, 5329, 5476, 5625, 5776, 5929, 6084, 6241, 6400, 6561, 6724, 6889, 7056, 7225, 7396, 7569, 7744, 7921, 8100, 8281, 8464, 8649, 8836, 9025, 9216, 9409, 9604, 9801, 10000]

In [14]:
cart = [5, 7, 9, 10, 12, 15, 19, 20, 22]
cashier_3 = []
for item in cart:
    if item % 2 == 0:
        cashier_3.append(item)
print(cashier_3)

[10, 12, 20, 22]

In [16]:
cashier_4 = [item for item in cart if item % 2==0]

In [17]:
cashier_4

[10, 12, 20, 22]

In [34]:
original_list1 = [2,3.75,.04,59.354,6,7.7777,8,9]
only_ints1 = []
for number in original_list1:
    if type(number)==int:
        only_ints1.append(number)
print(only_ints1)

original_list = [2,3.75,.04,59.354,6,7.7777,8,9]
only_ints = [number for number in original_list if type(number) == int]
print(only_ints)

[2, 6, 8, 9]
[2, 6, 8, 9]

In [67]:
list_a = [1, 2, 3, 4]
list_b = [2, 3, 4, 5]
common1=[]
for x in list_a:
    if x in list_b:
        common1.append(x)
print(common1)

list_a = [1, 2, 3, 4]
list_b = [2, 3, 4, 5]
common = [a for a in list_a if a in list_b]
print(common)

[2, 3, 4]
[2, 3, 4]

In [69]:
#counting number of spaces in string
some_string = 'dont stop when you are tired stop when you are done'
list_spaces =[]
for i in some_string:
    if i == " ":
        list_spaces.append(i)
print(len(list_spaces))

some_string = 'dont stop when you are tired stop when you are done'
spaces = [a for a in some_string if a == " "]
print(len(spaces))

10
10

In [78]:
num_list =[]
for i in range(1,1001):
    if i%7==0:
        num_list.append(i)
print(num_list)

[7, 14, 21, 28, 35, 42, 49, 56, 63, 70, 77, 84, 91, 98, 105, 112, 119, 126, 133, 140, 147, 154, 161, 168, 175, 182, 189, 196, 203, 210, 217, 224, 231, 238, 245, 252, 259, 266, 273, 280, 287, 294, 301, 308, 315, 322, 329, 336, 343, 350, 357, 364, 371, 378, 385, 392, 399, 406, 413, 420, 427, 434, 441, 448, 455, 462, 469, 476, 483, 490, 497, 504, 511, 518, 525, 532, 539, 546, 553, 560, 567, 574, 581, 588, 595, 602, 609, 616, 623, 630, 637, 644, 651, 658, 665, 672, 679, 686, 693, 700, 707, 714, 721, 728, 735, 742, 749, 756, 763, 770, 777, 784, 791, 798, 805, 812, 819, 826, 833, 840, 847, 854, 861, 868, 875, 882, 889, 896, 903, 910, 917, 924, 931, 938, 945, 952, 959, 966, 973, 980, 987, 994]

In [56]:
num = [a for a in range(1,1001) if a%7 == 0]
print(num)

[7, 14, 21, 28, 35, 42, 49, 56, 63, 70, 77, 84, 91, 98, 105, 112, 119, 126, 133, 140, 147, 154, 161, 168, 175, 182, 189, 196, 203, 210, 217, 224, 231, 238, 245, 252, 259, 266, 273, 280, 287, 294, 301, 308, 315, 322, 329, 336, 343, 350, 357, 364, 371, 378, 385, 392, 399, 406, 413, 420, 427, 434, 441, 448, 455, 462, 469, 476, 483, 490, 497, 504, 511, 518, 525, 532, 539, 546, 553, 560, 567, 574, 581, 588, 595, 602, 609, 616, 623, 630, 637, 644, 651, 658, 665, 672, 679, 686, 693, 700, 707, 714, 721, 728, 735, 742, 749, 756, 763, 770, 777, 784, 791, 798, 805, 812, 819, 826, 833, 840, 847, 854, 861, 868, 875, 882, 889, 896, 903, 910, 917, 924, 931, 938, 945, 952, 959, 966, 973, 980, 987, 994]

In [81]:
import pandas as pd 
data_1 = {'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'year': [2012, 2012, 2013, 2014, 2014], 
        'reports': [4, 24, 31, 2, 3]}
df = pd.DataFrame(data_1, index = ['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'])
df

             name  year  reports
Cochice     Jason  2012        4
Pima        Molly  2012       24
Santa Cruz   Tina  2013       31
Maricopa     Jake  2014        2
Yuma          Amy  2014        3

In [82]:
next_year = []

for row in df['year']:
    next_year.append(row + 1)

df['next_year'] = next_year

df

             name  year  reports  next_year
Cochice     Jason  2012        4       2013
Pima        Molly  2012       24       2013
Santa Cruz   Tina  2013       31       2014
Maricopa     Jake  2014        2       2015
Yuma          Amy  2014        3       2015

In [83]:
df['previous_year'] = [row-1 for row in df['year']]
df

             name  year  reports  next_year  previous_year
Cochice     Jason  2012        4       2013           2011
Pima        Molly  2012       24       2013           2011
Santa Cruz   Tina  2013       31       2014           2012
Maricopa     Jake  2014        2       2015           2013
Yuma          Amy  2014        3       2015           2013